In [1]:
import pandas as pd #import pandas

In [2]:
data = pd.read_csv('titanic/train.csv') #comma separed values, valores separados por vírgula

In [3]:
data.columns = ['PassageiroID', 'Sobreviventes', 'Classe', 'Nome', 'Sexo', 'Idade', 'IrmaosParesAmorosos',
       'PaisFilhos', 'Bilhete', 'Tarifa', 'Cabine', 'Embarque']

In [4]:
data.head()

,PassageiroID,Sobreviventes,Classe,Nome,Sexo,Idade,IrmaosParesAmorosos,PaisFilhos,Bilhete,Tarifa,Cabine,Embarque
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
data['Idade'].mean() #média

29.69911764705882

In [6]:
data['Idade'].sum() #somatório

21205.17

In [7]:
data['Idade'].count() #quantidade de idades

714

In [8]:
data['Idade'].median() #mediana

28.0

In [9]:
data['Idade'].mode() #moda

0    24.0
dtype: float64

In [10]:
data['Idade'].max() #valor máximo

80.0

In [11]:
data['Idade'].min() #valor mínimo

0.42

In [12]:
data['Idade'].idxmin() #index do valor minimo

803

In [13]:
data['Idade'].idxmax() #index do valor maximo

630

In [14]:
data.mean()

PassageiroID           446.000000
Sobreviventes            0.383838
Classe                   2.308642
Idade                   29.699118
IrmaosParesAmorosos      0.523008
PaisFilhos               0.381594
Tarifa                  32.204208
dtype: float64

In [15]:
data.sum()

PassageiroID                                                      397386
Sobreviventes                                                        342
Classe                                                              2057
Nome                   Braund, Mr. Owen HarrisCumings, Mrs. John Brad...
Sexo                   malefemalefemalefemalemalemalemalemalefemalefe...
Idade                                                            21205.2
IrmaosParesAmorosos                                                  466
PaisFilhos                                                           340
Bilhete                A/5 21171PC 17599STON/O2. 31012821138033734503...
Tarifa                                                           28693.9
dtype: object

In [16]:
data.min()

PassageiroID                             1
Sobreviventes                            0
Classe                                   1
Nome                   Abbing, Mr. Anthony
Sexo                                female
Idade                                 0.42
IrmaosParesAmorosos                      0
PaisFilhos                               0
Bilhete                             110152
Tarifa                                   0
dtype: object

In [17]:
data

,PassageiroID,Sobreviventes,Classe,Nome,Sexo,Idade,IrmaosParesAmorosos,PaisFilhos,Bilhete,Tarifa,Cabine,Embarque
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [18]:
data.iloc[630] #ver o que está em uma posição (index)

PassageiroID                                            631
Sobreviventes                                             1
Classe                                                    1
Nome                   Barkworth, Mr. Algernon Henry Wilson
Sexo                                                   male
Idade                                                    80
IrmaosParesAmorosos                                       0
PaisFilhos                                                0
Bilhete                                               27042
Tarifa                                                   30
Cabine                                                  A23
Embarque                                                  S
Name: 630, dtype: object

In [19]:
data.iloc[803] #ver o que está em uma posição (index) - data series

PassageiroID                                       804
Sobreviventes                                        1
Classe                                               3
Nome                   Thomas, Master. Assad Alexander
Sexo                                              male
Idade                                             0.42
IrmaosParesAmorosos                                  0
PaisFilhos                                           1
Bilhete                                           2625
Tarifa                                          8.5167
Cabine                                             NaN
Embarque                                             C
Name: 803, dtype: object

In [20]:
data.iloc[[630]] #ver o que está em uma posição (index)

,PassageiroID,Sobreviventes,Classe,Nome,Sexo,Idade,IrmaosParesAmorosos,PaisFilhos,Bilhete,Tarifa,Cabine,Embarque
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0,A23,S

In [21]:
data.iloc[[330,220,110]]

,PassageiroID,Sobreviventes,Classe,Nome,Sexo,Idade,IrmaosParesAmorosos,PaisFilhos,Bilhete,Tarifa,Cabine,Embarque
330,331,1,3,"McCoy, Miss. Agnes",female,NaN,2,0,367226,23.25,NaN,Q
220,221,1,3,"Sunderland, Mr. Victor Francis",male,16.0,0,0,SOTON/OQ 392089,8.05,NaN,S
110,111,0,1,"Porter, Mr. Walter Chamberlain",male,47.0,0,0,110465,52.00,C110,S

In [22]:
data.iloc[880:]

,PassageiroID,Sobreviventes,Classe,Nome,Sexo,Idade,IrmaosParesAmorosos,PaisFilhos,Bilhete,Tarifa,Cabine,Embarque
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [23]:
data['Classe'].iloc[2] #classe do passageiro de index 2

3

In [24]:
data['Nome'].iloc[2] #nome do passageiro index 2

'Heikkinen, Miss. Laina'

In [25]:
data[['Nome', 'Sexo', 'Idade', 'Tarifa', 'Classe', 'Sobreviventes']].loc[data['Sexo']=='male'] #Pesquisar Nome, Sexo, Idade, Tarifa, Classe e Sobreviventes somente de homens

,Nome,Sexo,Idade,Tarifa,Classe,Sobreviventes
0,"Braund, Mr. Owen Harris",male,22.0,7.2500,3,0
4,"Allen, Mr. William Henry",male,35.0,8.0500,3,0
5,"Moran, Mr. James",male,NaN,8.4583,3,0
6,"McCarthy, Mr. Timothy J",male,54.0,51.8625,1,0
7,"Palsson, Master. Gosta Leonard",male,2.0,21.0750,3,0
...,...,...,...,...,...,...
883,"Banfield, Mr. Frederick James",male,28.0,10.5000,2,0
884,"Sutehall, Mr. Henry Jr",male,25.0,7.0500,3,0
886,"Montvila, Rev. Juozas",male,27.0,13.0000,2,0
889,"Behr, Mr. Karl Howell",male,26.0,30.0000,1,1
890,"Dooley, Mr. Patrick",male,32.0,7.7500,3,0

In [26]:
data[['Nome', 'Sexo', 'Idade','Tarifa', 'Classe', 'Sobreviventes']].loc[data['Idade']==1] #Pesquisar Nome, Sexo, Tarifa, Classe e Sobreviventes somente de bebes

,Nome,Sexo,Idade,Tarifa,Classe,Sobreviventes
164,"Panula, Master. Eino Viljami",male,1.0,39.6875,3,0
172,"Johnson, Miss. Eleanor Ileen",female,1.0,11.1333,3,1
183,"Becker, Master. Richard F",male,1.0,39.0000,2,1
381,"Nakid, Miss. Maria (""Mary"")",female,1.0,15.7417,3,1
386,"Goodwin, Master. Sidney Leonard",male,1.0,46.9000,3,0
788,"Dean, Master. Bertram Vere",male,1.0,20.5750,3,1
827,"Mallet, Master. Andre",male,1.0,37.0042,2,1

In [27]:
data[['Nome', 'Sexo', 'Idade', 'Tarifa', 'Classe', 'Sobreviventes']].loc[data['Idade']>64] #Pesquisar Nome, Sexo, Idade, Tarifa, Classe e Sobreviventes somente de idosos (65 anos ++)

,Nome,Sexo,Idade,Tarifa,Classe,Sobreviventes
33,"Wheadon, Mr. Edward H",male,66.0,10.5000,2,0
54,"Ostby, Mr. Engelhart Cornelius",male,65.0,61.9792,1,0
96,"Goldschmidt, Mr. George B",male,71.0,34.6542,1,0
116,"Connors, Mr. Patrick",male,70.5,7.7500,3,0
280,"Duane, Mr. Frank",male,65.0,7.7500,3,0
456,"Millet, Mr. Francis Davis",male,65.0,26.5500,1,0
493,"Artagaveytia, Mr. Ramon",male,71.0,49.5042,1,0
630,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,30.0000,1,1
672,"Mitchell, Mr. Henry Michael",male,70.0,10.5000,2,0
745,"Crosby, Capt. Edward Gifford",male,70.0,71.0000,1,0
851,"Svensson, Mr. Johan",male,74.0,7.7750,3,0

In [28]:
data[['Nome', 'Sexo', 'Idade', 'Tarifa', 'Classe', 'Sobreviventes']]\
.loc[(data['Idade']>2) & (data['Idade']< 17)] #Pesquisar Nome, Sexo, Idade, Tarifa, Classe e Sobreviventes somente crianças e adolescentes entre 3 até 16 anos

,Nome,Sexo,Idade,Tarifa,Classe,Sobreviventes
9,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,30.0708,2,1
10,"Sandstrom, Miss. Marguerite Rut",female,4.0,16.7000,3,1
14,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,7.8542,3,0
22,"McGowan, Miss. Anna ""Annie""",female,15.0,8.0292,3,1
24,"Palsson, Miss. Torborg Danira",female,8.0,21.0750,3,0
...,...,...,...,...,...,...
850,"Andersson, Master. Sigvard Harald Elias",male,4.0,31.2750,3,0
852,"Boulos, Miss. Nourelain",female,9.0,15.2458,3,0
853,"Lines, Miss. Mary Conover",female,16.0,39.4000,1,1
869,"Johnson, Master. Harold Theodor",male,4.0,11.1333,3,1
875,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,7.2250,3,1

In [29]:
data[['Nome', 'Sexo', 'Idade', 'Tarifa', 'Classe', 'Sobreviventes']]\
.loc[(data['Sexo']=='female') & (data['Sobreviventes']== 1)].mean() #Pesquisar Nome, Sexo, Idade, Tarifa, Classe e Sobreviventes somente crianças e adolescentes entre 3 até 16 anos e que sobreviveram

Idade            28.847716
Tarifa           51.938573
Classe            1.918455
Sobreviventes     1.000000
dtype: float64

In [30]:
data['Sexo'].map({'male': 'homem', 'female': 'mulher'}).head() #map para trocar nome de objetos utilizando dicionário

0     homem
1    mulher
2    mulher
3    mulher
4     homem
Name: Sexo, dtype: object

In [31]:
data['Sexo'].replace({'male': 'homem', 'female': 'mulher'}).head() #replace para trocar nome de objetos utilizando dicionário

0     homem
1    mulher
2    mulher
3    mulher
4     homem
Name: Sexo, dtype: object

In [32]:
data['Sexo'].replace(['male', 'female'], ['homem', 'mulher']).head() ##replace para trocar nome de objetos utilizando lista

0     homem
1    mulher
2    mulher
3    mulher
4     homem
Name: Sexo, dtype: object

In [33]:
data['Sexo'].replace(['male', 'female'], 'pessoa').head() ##replace para trocar nome de objetos utilizando lista

0    pessoa
1    pessoa
2    pessoa
3    pessoa
4    pessoa
Name: Sexo, dtype: object

In [34]:
data['Sexo'] = data['Sexo'].map({'male': 'homem', 'female': 'mulher'}) #map para trocar nome de objetos utilizando dicionário

In [35]:
data

,PassageiroID,Sobreviventes,Classe,Nome,Sexo,Idade,IrmaosParesAmorosos,PaisFilhos,Bilhete,Tarifa,Cabine,Embarque
0,1,0,3,"Braund, Mr. Owen Harris",homem,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",mulher,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",mulher,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",mulher,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",homem,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",homem,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",mulher,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",mulher,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",homem,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",homem,32.0,0,0,370376,7.7500,NaN,Q

In [36]:
data.groupby('Sexo').sum() #Agrupar as colunas por sexo e mostrar a soma resultante em cada coluna

,PassageiroID,Sobreviventes,Classe,Idade,IrmaosParesAmorosos,PaisFilhos,Tarifa
Sexo,,,,,,,
homem,262043,109,1379,13919.17,248,136,14727.2865
mulher,135343,233,678,7286.00,218,204,13966.6628

In [37]:
data.groupby('Classe').mean() #Agrupar as colunas por classe e mostrar a média de cada uma coluna

,PassageiroID,Sobreviventes,Idade,IrmaosParesAmorosos,PaisFilhos,Tarifa
Classe,,,,,,
1,461.597222,0.629630,38.233441,0.416667,0.356481,84.154687
2,445.956522,0.472826,29.877630,0.402174,0.380435,20.662183
3,439.154786,0.242363,25.140620,0.615071,0.393075,13.675550

In [38]:
data.groupby('Sobreviventes').mean() #Agrupar as colunas por sobreviventes e mostrar a média de cada uma coluna

,PassageiroID,Classe,Idade,IrmaosParesAmorosos,PaisFilhos,Tarifa
Sobreviventes,,,,,,
0,447.016393,2.531876,30.626179,0.553734,0.329690,22.117887
1,444.368421,1.950292,28.343690,0.473684,0.464912,48.395408

In [39]:
data.groupby(['Sexo','Classe']).mean() #Agrupar as colunas por sexo e classe e mostrar a média relacionando ambas colunas

               PassageiroID  Sobreviventes      Idade  IrmaosParesAmorosos  \
Sexo   Classe
homem  1         455.729508       0.368852  41.281386             0.311475
       2         447.962963       0.157407  30.740707             0.342593
       3         455.515850       0.135447  26.507589             0.498559
mulher 1         469.212766       0.968085  34.611765             0.553191
       2         443.105263       0.921053  28.722973             0.486842
       3         399.729167       0.500000  21.750000             0.895833

               PaisFilhos      Tarifa
Sexo   Classe
homem  1         0.278689   67.226127
       2         0.222222   19.741782
       3         0.224784   12.661633
mulher 1         0.457447  106.125798
       2         0.605263   21.970121
       3         0.798611   16.118810

In [44]:
pd.crosstab(data['Sobreviventes'], data['Classe'], margins='True') #Cruzar as colunas Sobreviventes e Classe, magins = somatório total

Classe           1    2    3  All
Sobreviventes
0               80   97  372  549
1              136   87  119  342
All            216  184  491  891

In [45]:
pd.crosstab(data['Sobreviventes'], data['Sexo'], margins='True') #Cruzar as colunas Sobreviventes e Sexo, magins = somatório total

Sexo           homem  mulher  All
Sobreviventes
0                468      81  549
1                109     233  342
All              577     314  891

In [47]:
pd.crosstab(data['Sobreviventes'], data['Sexo'], margins='True').style.background_gradient(cmap='Blues') 
#Cruzar as colunas Sobreviventes e Sexo, magins = somatório total. Em azul, os maiores valores

In [49]:
pd.crosstab(data['Sobreviventes'], data['Sexo'], margins='True').style.background_gradient(cmap='OrRd') 
#Cruzar as colunas Sobreviventes e Sexo, magins = somatório total. Em vermelho forte, os maiores valores